In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv(r"/Users/mariamghavtadze/Documents/salary.csv")

In [8]:
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,32.0,Male,1,Software Engineer,5.0,90000.0,UK,White,0
1,28.0,Female,2,Data Analyst,3.0,65000.0,USA,Hispanic,0
2,45.0,Male,3,Manager,15.0,150000.0,Canada,White,1
3,36.0,Female,1,Sales Associate,7.0,60000.0,USA,Hispanic,0
4,52.0,Male,2,Director,20.0,200000.0,USA,Asian,0

In [10]:
print(f"DataFrame Shape: {df.shape}")

DataFrame Shape: (6684, 9)

In [22]:
print(df.isnull().sum())

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
Country                0
Race                   0
Senior                 0
dtype: int64

In [28]:
df.duplicated().sum()

1536

In [32]:

# Display some duplicate rows
duplicates = df[df.duplicated()]
print("\nSample duplicate rows:")
duplicates.head()

Total duplicate rows: 1536

Sample duplicate rows:

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
252,28.0,Male,1,Business Development Associate,2.0,40000.0,USA,Asian,0
308,29.0,Female,1,Business Development Associate,1.5,35000.0,Australia,White,0
343,33.0,Male,1,Business Analyst,4.0,60000.0,Canada,Black,0
372,44.0,Female,3,Business Analyst,15.0,150000.0,UK,White,1
390,31.0,Female,1,Software Engineer,6.0,155000.0,UK,Welsh,0

In [36]:
# Check for exact duplicate rows
exact_duplicates = df[df.duplicated(keep=False)]  # Keep=False shows all duplicate occurrences
print("\nExact Duplicate Rows Sample:")
exact_duplicates.head(10)

Exact Duplicate Rows Sample:

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
168,31.0,Female,1,HR Coordinator,4.0,50000.0,China,Korean,0
211,28.0,Male,1,Business Development Associate,2.0,40000.0,USA,Asian,0
252,28.0,Male,1,Business Development Associate,2.0,40000.0,USA,Asian,0
281,29.0,Female,1,Business Development Associate,1.5,35000.0,Australia,White,0
284,33.0,Male,1,Business Analyst,4.0,60000.0,Canada,Black,0
308,29.0,Female,1,Business Development Associate,1.5,35000.0,Australia,White,0
336,44.0,Female,3,Business Analyst,15.0,150000.0,UK,White,1
343,33.0,Male,1,Business Analyst,4.0,60000.0,Canada,Black,0
372,44.0,Female,3,Business Analyst,15.0,150000.0,UK,White,1
378,29.0,Female,1,Software Engineer,4.0,140000.0,Australia,White,0

In [38]:
# Drop exact duplicate rows and reset index
df = df.drop_duplicates().reset_index(drop=True)

✅ Duplicates removed. Cleaned data saved as 'salary_cleaned.csv'.
Final dataset shape: (5148, 9)

In [44]:
df["Age"] = df["Age"].astype(int)
df["Years of Experience"] = df["Years of Experience"].astype(float)
df["Salary"] = df["Salary"].astype(float)
df["Senior"] = df["Senior"].astype(int)

In [46]:
df.columns = df.columns.str.strip().str.replace(" ", "_")  # Replace spaces with underscores
print("Updated column names:", df.columns.tolist())  # Check again

Updated column names: ['Age', 'Gender', 'Education_Level', 'Job_Title', 'Years_of_Experience', 'Salary', 'Country', 'Race', 'Senior']

In [48]:
# Save cleaned dataset
df.to_csv(r"/Users/mariamghavtadze/Documents/salary_cleaned.csv", index=False)